dependencies/OpenFOAM/modules/OpenQBMM/tutorials/pbeTransportFoam/TaylorDispersion/0.pbe/moment.3
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      moment.3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    topWall
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
         value           uniform 1;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
